// retrun object to chain operation
// n.set(5).add(3).multiply(2).show();
// ایک ہی لائن میں کئی فنکشن یا آپریشن کو آپس میں جوڑ کر چلانا۔
// کیسے ممکن ہوتا ہے:
// ہر فنکشن اپنے آخر میں *this (یعنی موجودہ آبجیکٹ کا ریفرنس) ریٹرن کرتا ہے۔

// فائدہ:

// کوڈ چھوٹا اور صاف نظر آتا ہے۔

// ایک ہی آبجیکٹ پر بار بار الگ لائنیں لکھنے کی ضرورت نہیں پڑتی۔

// ضروری شرط:
// فنکشن کی ریٹرن ٹائپ آبجیکٹ کی ریفرنس ٹائپ ہو، مثلاً

// Number& add(int n) { ... return *this; }


// حقیقی مثال:
// // cout << "Hello" << "World";


// // یہاں << آپریٹر بھی چیننگ کے ذریعے کام کرتا ہے۔

// نتیجہ:
// // Chain Operation سے کوڈ زیادہ ریڈایبل (readable) اور موثر (efficient) بن جاتا ہے
